{
  "theme": {
    "Thème": "Développement Web"
  },
  "title": {
    "Titre": "TypeScript Fonctionnel"
  },
  "presentation": {
    "Présentation et description": "Cette formation explore les principes et les techniques de la programmation fonctionnelle appliqués à TypeScript, pour écrire du code plus clair, concis et maintenable."
  },
  "mindmap": {
    "Carte thématique": "Lien vers la mindmap (à compléter)"
  },
  "public_prospect": {
    "Public": "Développeurs TypeScript souhaitant améliorer la qualité de leur code et découvrir les avantages de la programmation fonctionnelle."
  },
  "pre_requis": {
    "Pré-requis et conditions d'accès à la formation (Qualiopi)": "Connaissance de base de TypeScript et de JavaScript."
  },
  "objectives": {
    "Objectifs pédagogiques (Qualiopi)": "Comprendre les concepts clés de la programmation fonctionnelle. Appliquer les principes de la programmation fonctionnelle en TypeScript. Utiliser des librairies fonctionnelles courantes. Améliorer la qualité et la maintenabilité du code."
  },
  "skills": {
    "Compétences visées (Qualiopi)": "Ecrire du code TypeScript fonctionnel, plus clair, concis et maintenable. Maîtriser les concepts d'immutabilité, de fonctions pures et de composition de fonctions. Intégrer des librairies fonctionnelles dans des projets TypeScript."
  },
  "timing": {
    "Durée": "3 jours"
  },
  "means": {
    "Moyen d'accompagnement et Suivi pédagogique (Qualiopi)": "Support de cours, exercices pratiques, assistance personnalisée."
  },
  "program": {
    "Programme pédagogique": "Introduction à la programmation fonctionnelle. Fonctions pures, immutabilité, composition de fonctions. Gestion des effets de bord. Manipulation de données avec des fonctions d'ordre supérieur (map, filter, reduce). Utilisation de librairies fonctionnelles comme fp-ts ou Ramda. Mise en pratique avec des exemples concrets en TypeScript."
  },
  "evaluations": {
    "Modalités d'évaluations": "Exercices pratiques et revue de code."
  },
  "certification": {
    "Certification": "Certificat de réussite délivré à la fin de la formation."
  },
  "place": {
    "Lieux": "En ligne ou en présentiel (à définir)"
  },
  "price": {
    "Tarifs": "900€"
  },
  "infrastructure": {
    "Moyens logistiques et matériels": "Salle de formation équipée ou accès à un environnement de développement en ligne."
  },
  "pursuit": {
    "Poursuite en formation": "Formations avancées sur la programmation réactive fonctionnelle (RxJS)."
  },
  "access_time": {
    "Délais d'accès": "Inscription possible jusqu'à une semaine avant le début de la formation."
  },
  "mobility": {
    "Accessibilité et Handicap": "Accès aux personnes à mobilité réduite, supports de cours adaptés."
  },
  "testimony": {
    "Témoignage Evaluation de la formation": "Formation très instructive, les concepts sont bien expliqués et les exercices permettent de mettre en pratique les notions abordées."
  },
  "testimony_customer": {
    "Témoignage apprenant/commanditaire": "Grâce à cette formation, j'ai pu améliorer la qualité de mon code TypeScript et adopter une approche plus fonctionnelle."
  }
}