{
  "theme": {
    "Thème": "Gradle"
  },
  "title": {
    "Titre": "Maîtriser Gradle : Automatisation de builds pour projets Java/Kotlin"
  },
  "presentation": {
    "Présentation et description": "Cette formation vous permettra de maîtriser Gradle, l'outil de build incontournable pour les projets Java/Kotlin."
  },
  "mindmap": {
    "Carte thématique": "https://example.com/mindmap-gradle.png"
  },
  "public_prospect": {
    "Public": "Développeurs Java/Kotlin souhaitant automatiser leurs builds et améliorer leur productivité."
  },
  "pre_requis": {
    "Pré-requis et conditions d'accès à la formation (Qualiopi)": "Connaissance de base de Java ou Kotlin et d'un IDE comme IntelliJ IDEA ou Eclipse."
  },
  "objectives": {
    "Objectifs pédagogiques (Qualiopi)": "Comprendre les fondamentaux de Gradle. Écrire et configurer des scripts Gradle. Gérer les dépendances. Automatiser les tâches de build, de test et de déploiement."
  },
  "skills": {
    "Compétences visées (Qualiopi)": "Configurer et utiliser Gradle pour gérer des projets Java/Kotlin. Créer des builds robustes et reproductibles. Intégrer Gradle avec d'autres outils de développement."
  },
  "timing": {
    "Durée": "3 jours"
  },
  "means": {
    "Moyen d'accompagnement et Suivi pédagogique (Qualiopi)": "Support de cours, exercices pratiques, assistance personnalisée du formateur."
  },
  "program": {
    "Programme pédagogique": "Introduction à Gradle et à son écosystème. Configuration de projets. Gestion des dépendances avec des repositories. Tâches de build personnalisées. Tests unitaires et d'intégration avec Gradle. Automatisation du déploiement. Bonnes pratiques et astuces."
  },
  "evaluations": {
    "Modalités d'évaluations": "Évaluation continue basée sur des exercices pratiques et un projet final."
  },
  "certification": {
    "Certification": "Certificat de réussite délivré à la fin de la formation."
  },
  "place": {
    "Lieux": "En présentiel à Paris ou à distance."
  },
  "price": {
    "Tarifs": "900€"
  },
  "infrastructure": {
    "Moyens logistiques et matériels": "Salle de formation équipée ou accès à une plateforme d'apprentissage en ligne."
  },
  "pursuit": {
    "Poursuite en formation": "Formations avancées sur l'automatisation DevOps."
  },
  "access_time": {
    "Délais d'accès": "Inscription possible jusqu'à une semaine avant le début de la formation."
  },
  "mobility": {
    "Accessibilité et Handicap": "Accès aux personnes à mobilité réduite."
  },
  "testimony": {
    "Témoignage Evaluation de la formation": "Formation très pragmatique et bien structurée. Le formateur est très compétent et disponible."
  },
  "testimony_customer": {
    "Témoignage apprenant/commanditaire": "Gradle n'a plus de secrets pour moi ! Cette formation m'a permis de gagner beaucoup de temps dans la gestion de mes projets."
  }
}